#  lab-customer-analysis-round-1 Jose Munoz Alvis Solutions

In [1]:
import pandas as pd

In [2]:
import numpy as np

### Reading Data

In [4]:
file1 = pd.read_excel("file1.xlsx")

In [5]:
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0,106,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357,68,1/0/00,Personal Auto,Four-Door Car,17.269323

In [6]:
file2 = pd.read_excel("file2.xlsx")

In [7]:
file2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [8]:
file3 = pd.read_excel("file3.xlsx")

In [9]:
file3.head()

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [10]:
# Show the DataFrame's shape.

In [11]:
file1.shape

(1071, 11)

In [12]:
file2.shape

(996, 11)

In [13]:
file3.shape

(7070, 11)

### Standardize header names.

In [15]:
file1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [16]:
file1_cols=  []
for i in range(len(file1.columns)):
    file1_cols.append(file1.columns[i].lower())
    
file1_cols

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [17]:
file1.columns = file1_cols

In [18]:
file1.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [19]:
file2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [20]:
file2_cols=  []
for i in range(len(file2.columns)):
    file2_cols.append(file2.columns[i].lower())
    
file2_cols

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'total claim amount',
 'policy type',
 'vehicle class']

In [21]:
file2.columns = file2_cols

In [22]:
file2.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'total claim amount', 'policy type', 'vehicle class'],
      dtype='object')

In [23]:
file3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [24]:
file3_cols=  []
for i in range(len(file3.columns)):
    file3_cols.append(file3.columns[i].lower())
    
file3_cols

['customer',
 'state',
 'customer lifetime value',
 'education',
 'gender',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'total claim amount',
 'vehicle class']

In [25]:
file3.columns = file3_cols

In [26]:
file3.columns

Index(['customer', 'state', 'customer lifetime value', 'education', 'gender',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'total claim amount', 'vehicle class'],
      dtype='object')

### Rearrange the columns in the dataframe as needed

In [28]:
file2=file2[['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount']]

In [29]:
file2 = file2.rename(columns={"st" : "state"})

In [30]:
file2.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,Special Auto,SUV,547.2
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,Personal Auto,Two-Door Car,537.6
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,Personal Auto,Luxury Car,1027.2
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,Corporate Auto,Two-Door Car,451.2

In [31]:
file3=file3[['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount']]

In [32]:
file3.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.200000
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,Personal Auto,Two-Door Car,3.468912
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,Personal Auto,Four-Door Car,393.600000
3,KX23516,California,F,High School or Below,4455.843406,0,121,0,Personal Auto,SUV,699.615192
4,FN77294,California,M,High School or Below,7704.958480,30366,101,2,Personal Auto,SUV,484.800000

In [33]:
file1 = file1.rename(columns={"st" : "state"})

In [34]:
file1.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0,106,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357,68,1/0/00,Personal Auto,Four-Door Car,17.269323

### Concatenate the three dataframes

In [38]:
column_names = file1.columns

In [42]:
new_data = pd.DataFrame(columns=file1.columns)

In [43]:
new_data.head()

Empty DataFrame
Columns: [customer, state, gender, education, customer lifetime value, income, monthly premium auto, number of open complaints, policy type, vehicle class, total claim amount]
Index: []

In [45]:
new_data = pd.concat([new_data,file1,file2,file3], axis=0)

In [46]:
new_data.shape

(9137, 11)

### Which columns are numerical? 
'customer lifetime value', 'income', 'monthly premium auto', 
'number of open complaints', 'total claim amount

In [47]:
new_data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value       object
income                        object
monthly premium auto          object
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

### Which columns are categorical? 

'customer', 'state', 'gender', 'education', 
'policy type', 'vehicle class',

### Delete the column education  and the number of open complaints from the dataframe.

In [48]:
new_data = new_data.drop (["education", "number of open complaints"], axis = 1)

In [49]:
new_data.head()

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357,68,Personal Auto,Four-Door Car,17.269323

### Correct the values in the column customer lifetime value. 
They are given as a percent, 
so multiply them by 100 and change dtype to numerical type.

In [ ]:
# https://datatofish.com/string-to-integer-dataframe/
# https://www.geeksforgeeks.org/how-to-convert-string-to-integer-in-pandas-dataframe/
# https://stackoverflow.com/questions/13682044/remove-unwanted-parts-from-strings-in-a-column
# https://datatofish.com/replace-character-pandas-dataframe/

#df['column name'] = df['column name'].str.replace('old character','new character')
# df['first_set'] = df['first_set'].str.replace('_','|')

In [62]:
# repalce the unnecessary characters 

new_data["customer lifetime value"] = new_data["customer lifetime value"].str.replace("%", "")

In [67]:
#Replace NaN Values with Zeros
# https://datatofish.com/replace-nan-values-with-zeros/
#df['DataFrame Column'] = df['DataFrame Column'].fillna(0)
new_data["customer lifetime value"] = new_data["customer lifetime value"].fillna(0)

In [68]:
new_data.head()

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,0,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65,36357,68,Personal Auto,Four-Door Car,17.269323

In [71]:
new_data["customer lifetime value"]

0                0
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
7065             0
7066             0
7067             0
7068             0
7069             0
Name: customer lifetime value, Length: 9134, dtype: object

In [ ]:
# multiply per 100 
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.multiply.html

In [70]:
new_data["customer lifetime value"] * 100

0                                                       0
1       697953.59697953.59697953.59697953.59697953.596...
2       1288743.171288743.171288743.171288743.17128874...
3       764586.18764586.18764586.18764586.18764586.187...
4       536307.65536307.65536307.65536307.65536307.655...
                              ...
7065                                                    0
7066                                                    0
7067                                                    0
7068                                                    0
7069                                                    0
Name: customer lifetime value, Length: 9134, dtype: object

In [74]:
# change dtype to numerical type.
print(new_data["customer lifetime value"].dtypes)

object

In [78]:
# https://www.geeksforgeeks.org/change-the-data-type-of-a-column-or-a-pandas-series/

new_data["customer lifetime value"].astype(float)

0             0.00
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
7065          0.00
7066          0.00
7067          0.00
7068          0.00
7069          0.00
Name: customer lifetime value, Length: 9134, dtype: float64

### Check for duplicate rows in the data and remove if any.

In [53]:
print (new_data.shape)

(9137, 9)

In [54]:
new_data[new_data.duplicated()]

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,GS98873,Arizona,F,323912.47%,16061,88,Personal Auto,Four-Door Car,633.6
1,CW49887,California,F,462680.11%,79487,114,Special Auto,SUV,547.2
2,MY31220,California,F,899704.02%,54230,112,Personal Auto,Two-Door Car,537.6

In [55]:
# https://www.tutorialspoint.com/how-to-find-and-filter-duplicate-rows-in-pandas
new_data = new_data.drop_duplicates()

In [56]:
print (new_data.shape)

(9134, 9)

### Filter out the data for customers who have an income of 0 or less.

In [58]:
new_data[new_data["income"] == 0 ]

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0,94,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,764586.18%,0,106,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,721610.03%,0,101,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,473899.20%,0,67,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,5678.050167,0,76,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,19872.262000,0,185,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,4628.995325,0,67,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,8163.890428,0,85,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,2611.836866,0,77,Corporate Auto,Two-Door Car,369.600000

In [61]:
new_data[new_data["income"] <= 0 ]

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0,94,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,764586.18%,0,106,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,721610.03%,0,101,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,473899.20%,0,67,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,5678.050167,0,76,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,19872.262000,0,185,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,4628.995325,0,67,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,8163.890428,0,85,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,2611.836866,0,77,Corporate Auto,Two-Door Car,369.600000